import fetch from 'node-fetch';

export default async (req, res) => {
  res.setHeader('Access-Control-Allow-Origin', '*');
  res.setHeader('Access-Control-Allow-Methods', 'GET, OPTIONS');
  res.setHeader('Access-Control-Allow-Headers', 'Content-Type');
  const ouut = {
    "ok": true,
    "result": ` Читайте все описание<br>
Скретчен — рп страна на Скретче, не является реальной, и роли действительны только в пределах рп Скретчена<br>
—— Монархия ——<br>
Форма Монархии — выборная<br>
Ранги монархов:<br>
1 ранг. князь<br>
2 ранг. Младший Князь<br>
——Главы Регионов——<br>
Губернии — 1 ранг граф<br>
Республика — 1 ранг глава, 2 ранг высший представитель, 3 ранг представитель<br>
Область — 1 ранг губернатор<br>
Отдельный город или центр региона — 1 ранг Мэр высшей мэрии, 2 ранг мэр<br>
—— Роли ——<br>
Князь: @SHAMAN2016<br>
Вице-Князь: @DiamondCat2026<br>
Советник Князя: @DiamondCat2026<br>
Младший Князь: @qa3141<br>
Генерал армии: @SHAMAN2016<br>
Солдаты:<br>
Нету<br>
Депутаты НВПС:<br>
@SHAMAN2016 - глава НВПС<br>
Депутаты DSN123:<br>
@DiamondCat1234567 - глава DSN123<br>
Депутаты САПЗА Скретчен:<br>
@qa3141 — глава партии<br>
Глава Скретченской республики: @SHAMAN2016<br>
Граф Скретчеславской Губернии: @SHAMAN2016<br>
Граф Лостанской Губернии: @DiamondCat2026<br>
Глава респбулики Карган: @DiamondCat2026<br>
Губернатор Ганской Области: @SHAMAN2016<br>
Председатель ВСС: @SHAMAN2016<br>
Министр мероприятий: @SHAMAN2016<br>
Министр обороны: @DiamondCat2026<br>
Министр п.: @DiamondCat2026<br>
Министр связи: @SHAMAN2016<br>
Министр иностранных дел: @DiamondCat2026<br>
Министр образования: @SHAMAN2016<br>
Министр программирования: Скоро будет...<br>
Министр технологий: Нет<br>
Министр финансов: Нет<br>
Министр транспорта: Нет<br>
—— Партии ——<br>
НВПС (Национальная Великая Партия Скретчена), один депутат.<br>
DSN123 (DiamondSN1234567), один депутат<br>
САПЗА Скретчен, один депутат<br>
—— Роли в СкретченКомНадзоре ——<br>
Глава 1-ого ранга:<br>
SHAMAN2016<br>
—— Враги ——<br>
Нет<br>
—— Союзники ——<br>
Пока нет...<br>
—— Ссылки ——<br>
Тема на форуме: https://scratch.mit.edu/discuss/topic/850545/<br>
Карта: https://scratch.mit.edu/projects/1270750410<br>
Символистика: https://scratch.mit.edu/projects/1233512048/<br>
Паспорт: https://scratch.mit.edu/projects/1261366089<br>
Основная работа в Скретчене: https://scratch.mit.edu/projects/1233723649<br>
Зарегестрировать компанию: https://scratch.mit.edu/projects/1237818081<br>
Зарегестрировать партию: https://scratch.mit.edu/projects/1239082403<br>
Законодательство Скретчена: https://scratch.mit.edu/projects/1251126307<br>
Доменные зоны: https://scratch.mit.edu/projects/1239607720/<br>
Виза: https://scratch.mit.edu/projects/1240455346/<br>
Продажный кодекс: https://scratch.mit.edu/projects/1263053919<br>
Трудовой кодекс: https://scratch.mit.edu/projects/1263188267/<br>
Интернет кодекс: https://scratch.mit.edu/projects/1266108233<br>
Мед. Кодекс: https://scratch.mit.edu/projects/1268214613/<br>
Правительственный Кодекс: https://scratch.mit.edu/projects/1273956347<br>
Заявки в правительство: https://scratch.mit.edu/projects/1273975708<br>
!!Рекомендуется ознакомится со всеми проектами!!<br>
—— История правителей ——<br>
1. SHAMAN2016 (НВПС). Призедент 29.01.2025-25.01.2026<br>
2. SHAMAN2016 князь 25.01.2026-??.??.????; qa3141 младший князь 25.02.2026 (оффициально, а победа в выборах монархов в столбце младшего князя была 18.02.2026, так же первый младший князь, т.к. после княжеской революции никто не был назначен младшим князем, но этот титул монарха был в ОКС)<br>
—— Выборы ——<br>
1. 11 Февраля — 15 Февраля<br>
2. 11 мая — 15 мая<br>
3. 1 Июля — 4 Июля<br>
4. 1 Сентября — 4 сентября<br>
5. 1 декабря — 4 декабря<br>
—— Должности ——<br>
Князь — 12.000.000 Скретчекоинов/мес, (1/1)<br>
Вице-князь — 10.000.000 Скретчекоинов/мес (1/1)<br>
Советник князя — 10.000.000 Скретчекоинов/мес (1/1)<br>
Генерал армии — 5.000.000 Скретчекоинов/мес (1/1)<br>
Солдат — 3.000.000 Скретчекоинов/мес (0)<br>
Депутат НВПС — 189.000 Скретчекоинов/мес (1)<br>
Депутат DSN123 — 50.000 Скретчекоинов/мес (1)<br>
Глава республики — 11.000.000 Скретчекоинов/мес (4)<br>
Глава ВСС — 16.000.000 Скретчекоинов/мес (1/1)<br>
Министр мероприятий — 12.000.000 Скретчекоинов/мес (1/1)<br>
Министр полиц. — 3.000.000 Скретчекоинов/мес (0/1)<br>
Министр обороны — 5.000.000 Скретчекоинов/мес (1/1)<br>
Министр связи — 10.000.000 Скретчекоинов/мес (1/1)<br>
Министр иностранных дел — 9.000.000 Скретчекоинов/мес (1/1)<br>
Министр образования — 1.000.000 Скретчекоинов/мес (1/1)<br>
Министр программирования — 5.000.000 Скретчекоинов/месяц (0/1)<br>
Младший Князь — 8.000.000 СкретчеКоинов/месяц (0/1)<br>
Компании:<br>
Интерграм (id1)<br>
Scratchen Studio (id2)<br>
Ки (id3)<br>
Карандашик! (id4)<br>
ScraJang (id5)<br>
GalertFood (id6)<br>
Los-Kargan Studio (id7)<br>
—— Революции ——<br>
1. Переход в княжество. Призедент заменяется Князем, и появляется младший князь, SHAMAN2016 стал Князем (Монархом) Ильхамом Первым — 25.01.2026-02.02.2026<br>
—— Населения Городов (рейтинг) ——<br>
1. Скретченовск 670.586 человек<br>
2. Скретчеславск 217.013 человек<br>
3. Моребург 35.226 человек<br>
4. Туренг 50.129 человек<br>
5. Таренг 23.545 человек<br>
Всего в топе: 996.499<br>
    `
  }
  res.status(200).json(ouut)
}
