import fetch from 'node-fetch';

export default async (req, res) => {
  res.setHeader('Access-Control-Allow-Origin', '*');
  res.setHeader('Access-Control-Allow-Methods', 'GET, OPTIONS');
  res.setHeader('Access-Control-Allow-Headers', 'Content-Type');
  const ouut = {
    "ok": true,
    "result": `
Читайте все описание
Скретчен — рп страна на Скретче, не является реальной, и роли действительны только в пределах рп Скретчена
—— Монархия ——
Форма Монархии — выборная
Ранги монархов:
1 ранг. князь
2 ранг. Младший Князь
——Главы Регионов——
Губернии — 1 ранг граф
Республика — 1 ранг глава, 2 ранг высший представитель, 3 ранг представитель
Область — 1 ранг губернатор
Отдельный город или центр региона — 1 ранг Мэр высшей мэрии, 2 ранг мэр
—— Роли ——
Князь: @SHAMAN2016
Вице-Князь: @DiamondCat2026
Советник Князя: @DiamondCat2026
Младший Князь: @qa3141
Генерал армии: @SHAMAN2016
Солдаты:
Нету
Депутаты НВПС:
@SHAMAN2016 - глава НВПС
Депутаты DSN123:
@DiamondCat1234567 - глава DSN123
Депутаты САПЗА Скретчен:
@qa3141 — глава партии
Глава Скретченской республики: @SHAMAN2016
Граф Скретчеславской Губернии: @SHAMAN2016
Граф Лостанской Губернии: @DiamondCat2026
Глава респбулики Карган: @DiamondCat2026
Губернатор Ганской Области: @SHAMAN2016
Председатель ВСС: @SHAMAN2016
Министр мероприятий: @SHAMAN2016
Министр обороны: @DiamondCat2026
Министр п.: @DiamondCat2026
Министр связи: @SHAMAN2016
Министр иностранных дел: @DiamondCat2026
Министр образования: @SHAMAN2016
Министр программирования: Скоро будет...
Министр технологий: Нет
Министр финансов: Нет
Министр транспорта: Нет
—— Партии ——
НВПС (Национальная Великая Партия Скретчена), один депутат.
DSN123 (DiamondSN1234567), один депутат
САПЗА Скретчен, один депутат
—— Роли в СкретченКомНадзоре ——
Глава 1-ого ранга:
SHAMAN2016
—— Враги ——
Нет
—— Союзники ——
Пока нет...
—— Ссылки ——
Тема на форуме: https://scratch.mit.edu/discuss/topic/850545/
Карта: https://scratch.mit.edu/projects/1270750410
Символистика: https://scratch.mit.edu/projects/1233512048/
Паспорт: https://scratch.mit.edu/projects/1261366089
Основная работа в Скретчене: https://scratch.mit.edu/projects/1233723649
Зарегестрировать компанию: https://scratch.mit.edu/projects/1237818081
Зарегестрировать партию: https://scratch.mit.edu/projects/1239082403
Законодательство Скретчена: https://scratch.mit.edu/projects/1251126307
Доменные зоны: https://scratch.mit.edu/projects/1239607720/
Виза: https://scratch.mit.edu/projects/1240455346/
Продажный кодекс: https://scratch.mit.edu/projects/1263053919
Трудовой кодекс: https://scratch.mit.edu/projects/1263188267/
Интернет кодекс: https://scratch.mit.edu/projects/1266108233
Мед. Кодекс: https://scratch.mit.edu/projects/1268214613/
Правительственный Кодекс: https://scratch.mit.edu/projects/1273956347
Заявки в правительство: https://scratch.mit.edu/projects/1273975708
!!Рекомендуется ознакомится со всеми проектами!!
—— История правителей ——
1. SHAMAN2016 (НВПС). Призедент 29.01.2025-25.01.2026
2. SHAMAN2016 князь 25.01.2026-??.??.????; qa3141 младший князь 25.02.2026 (оффициально, а победа в выборах монархов в столбце младшего князя была 18.02.2026, так же первый младший князь, т.к. после княжеской революции никто не был назначен младшим князем, но этот титул монарха был в ОКС)
—— Выборы ——
1. 11 Февраля — 15 Февраля
2. 11 мая — 15 мая
3. 1 Июля — 4 Июля
4. 1 Сентября — 4 сентября
5. 1 декабря — 4 декабря
—— Должности ——
Князь — 12.000.000 Скретчекоинов/мес, (1/1)
Вице-князь — 10.000.000 Скретчекоинов/мес (1/1)
Советник князя — 10.000.000 Скретчекоинов/мес (1/1)
Генерал армии — 5.000.000 Скретчекоинов/мес (1/1)
Солдат — 3.000.000 Скретчекоинов/мес (0)
Депутат НВПС — 189.000 Скретчекоинов/мес (1)
Депутат DSN123 — 50.000 Скретчекоинов/мес (1)
Глава республики — 11.000.000 Скретчекоинов/мес (4)
Глава ВСС — 16.000.000 Скретчекоинов/мес (1/1)
Министр мероприятий — 12.000.000 Скретчекоинов/мес (1/1)
Министр полиц. — 3.000.000 Скретчекоинов/мес (0/1)
Министр обороны — 5.000.000 Скретчекоинов/мес (1/1)
Министр связи — 10.000.000 Скретчекоинов/мес (1/1)
Министр иностранных дел — 9.000.000 Скретчекоинов/мес (1/1)
Министр образования — 1.000.000 Скретчекоинов/мес (1/1)
Министр программирования — 5.000.000 Скретчекоинов/месяц (0/1)
Младший Князь — 8.000.000 СкретчеКоинов/месяц (0/1)
Компании:
Интерграм (id1)
Scratchen Studio (id2)
Ки (id3)
Карандашик! (id4)
ScraJang (id5)
GalertFood (id6)
Los-Kargan Studio (id7)
—— Революции ——
1. Переход в княжество. Призедент заменяется Князем, и появляется младший князь, SHAMAN2016 стал Князем (Монархом) Ильхамом Первым — 25.01.2026-02.02.2026
—— Населения Городов (рейтинг) ——
1. Скретченовск 670.586 человек
2. Скретчеславск 217.013 человек
3. Моребург 35.226 человек
4. Туренг 50.129 человек
5. Таренг 23.545 человек
Всего в топе: 996.499
    `
  }
  res.status(200).json(ouut)
}
